CREATE DATABASE testdebtor;

USE testdebtor;

-- DROP TABLE debtor;

CREATE TABLE debtor(
id INT AUTO_INCREMENT PRIMARY KEY,
l_name VARCHAR(50) NOT NULL,
f_name VARCHAR(50) NOT NULL,
m_name VARCHAR(50),
duty DOUBLE NOT NULL,
currency VARCHAR(50),
loan_agreement VARCHAR(50),
agreement_date DATE);

CREATE INDEX l_name_index ON debtor(l_name);  
CREATE INDEX f_name_index ON debtor(f_name);  
CREATE INDEX m_name_index ON debtor(m_name);  
CREATE INDEX loan_agreement_index ON debtor(loan_agreement); 

INSERT INTO debtor (l_name, f_name, m_name, duty, currency, loan_agreement, agreement_date) 
VALUES 
('Фрікацел', 'Сергій', 'Трифонович',	0.00,	'гривня (UAH)', '2-6807/07', '2008-04-14'),
('Маленко', 'Аркадій', 'Валерійович',	0.00,	'гривня (UAH)',	'2-4695/06',	'2006-11-15'),
('Рябченко', 'Олександр', 'Леонідович',	0.00,	'гривня (UAH)',	'2-2868/11',	'2012-07-30'),
('Балтов', 'Сергій', 'Вікторович',	50000.00,	'гривня (UAH)',	'500/5009/17',	'2018-05-22'),
('Балтов', 'Сергій', 'Вікторович',	11359.42,	'гривня (UAH)',	'500/5009/17',	'2018-05-22'),
('Батуріна', 'Тетяна', 'Василівна',	704.80,	'гривня (UAH)',	'502/1845/18',	'2019-01-16'),
('Соколова', 'Анастасія', 'Геннадіївна',	83620.95,	'гривня (UAH)',	'502/1007/18',	'2018-11-01'),
('Засієнко', 'Микола', 'Васильович',	13848.92,	'гривня (UAH)',	'502/827/18',	'2018-11-01'),
('Шевченко', 'Ігор', 'Ігорович',	0.00,	'гривня (UAH)',	'502/2232/18',	'2018-12-11'),
('Бабелюк', 'Любов', 'Василівна',	112237.60,	'гривня (UAH)',	'502/1074/18',	'2018-12-22'),
('Голощак', 'Володимир', 'Андрійович',	11307.70,	'гривня (UAH)',	'502/1274/18',	'2019-02-19'),
('Жигарєв', 'Сергій', 'Михайлович',	66182.74,	'гривня (UAH)',	'502/2064/17',	'2018-03-29'),
('Орел', 'Олег', 'Володимирович',	0.00,	'гривня (UAH)',	'591/4035/18',	'2019-01-28'),
('Дімов', 'Дмитро', 'Дмитрович',	21345.10,	'гривня (UAH)',	'502/2225/18',	'2019-05-10'),
('Городниченко', 'Сергій', 'Вікторович',	65000.00,	'гривня (UAH)',	'2-3165/11',	'2017-07-19'),
('Черепаха', 'Сергій', 'Миколайович',	607796.74,	'гривня (UAH)',	'2-746/10',	'2010-06-17'),
('Коваль', 'Геннадій', 'Степанович',	118316.37,	'гривня (UAH)',	'502/576/18',	'2018-07-24'),
('Гарага', 'Євген', 'Андрійович',	507.83,	'гривня (UAH)',	'2-1250/11',	'2011-08-15'),
('Кірієнко', 'Дмитро', 'Васильович',	9605.00,	'гривня (UAH)',	'502/961/19',	'2020-08-10'),
('Чебан-Лянка', 'Євгеній', 'Вікторович',	2167.16,	'гривня (UAH)',	'502/1688/19',	'2020-10-20'),
('Земляной', 'Руслан', 'Дмитрович',	908.00,	'гривня (UAH)',	'404/3853/20',	'2021-04-01'),
('Степаненко', 'Олександр', 'Дмитрович',	13275.39,	'гривня (UAH)',	'521/16583/19',	'2021-12-09'),
('Кирилов', 'Василь', 'Валентинович',	4749.98,	'гривня (UAH)',	'502/1095/20',	'2022-04-19'),
('Проданов', 'Юрій', 'Дмитрович',	0.00,	'гривня (UAH)',	'502/29/22',	'2022-04-28'),
('Дронова', 'Валентина', 'Юріївна',	6511.11,	'гривня (UAH)',	'1513/1533/12',	'2021-09-08');

SELECT * FROM debtor;
SELECT * FROM debtor WHERE duty > 100000;
SELECT * FROM debtor WHERE duty = 0;
SELECT * FROM debtor WHERE duty BETWEEN 40000 AND 100000;
SELECT * FROM debtor WHERE l_name LIKE 'С%';
SELECT * FROM debtor WHERE l_name LIKE '%ра%';
SELECT * FROM debtor AS d WHERE timestampdiff(year, agreement_date, CURDATE()) > 3 AND duty != 0;
SELECT * FROM debtor AS d WHERE timestampdiff(year, agreement_date, CURDATE()) > 3 AND duty != 0 ORDER BY agreement_date;
SELECT * FROM debtor AS d WHERE timestampdiff(year, agreement_date, CURDATE()) > 3 AND duty != 0 ORDER BY duty DESC LIMIT 3;



